/***********************************************************************************************************************
Copyright 2019 - 2027 深圳国泰安教育技术股份有限公司. All rights reserved.
文件名 :		bit_band.h
描述   :      I2C驱动程序头文件
作者   :      hongxiang.liu
版本   :      V1.0
修改   :  
完成日期:		2019.3.21
************************************************************************************************************************/
#ifndef _BIT_BAND_H_
#define _BIT_BAND_H_

#include "stm32f10x.h"

#define sbit(x) (1 << (x))
#define bit(x,y) ((x) << (y))


#endif

